<?php
// Hebrew Language File for Sypex Dumper 2
$LNG = array(

// אינפורמציה לגבי הקובץ
'ver'				=> 20007, // לאיזה גירסה מיעד הקובץ
'translated'		=> 'Webtun (http//webtun.com/)', // פרטים של המתרגם
'name'				=> 'עיברית', // שפה

// סרגל הכלים
'tbar_backup'		=> 'יצוא',
'tbar_restore'		=> 'יבוא', 
'tbar_files'		=> 'קבצים',
'tbar_services'		=> 'שירותים',
'tbar_options'		=> 'אופציות',
'tbar_createdb'		=> 'ליצור בסיס נתונים',
'tbar_connects'		=> 'חיבור',
'tbar_exit'			=> 'יציאה',

// שמות של האובייקטים בעץ
'obj_tables'		=> 'טבלאות',
'obj_views'			=> 'תוכן',
'obj_procs'			=> 'נהלים',
'obj_funcs'			=> 'פונקציות',
'obj_trigs'			=> 'טריגרים',
'obj_events'		=> 'ההתפתחויות',

// יצוא
'zip_max'			=> 'מקסימום',
'zip_min'			=> 'מינימום',
'zip_none'			=> 'ללא דחיסה',
'default'			=> 'כברירת מחדל',
'combo_db'			=> 'בסיס נתונים', 
'combo_charset'		=> 'קידוד', 
'combo_zip'			=> 'דחיסה', 
'combo_comments'	=> 'הערה',
'del_legend'		=> 'אוטומטי למחוק אם',
'del_date'			=> 'גיל שלה קבצים יתר מ %s ימים',
'del_count'			=> 'כמות הקבצים גדולה מ %s',
'tree'				=> 'בחר את האובייקטים',
'no_saved'			=> '*אין משימות שמורות',
'btn_save'			=> 'לשמור',
'btn_exec'			=> 'לבצע',
'outfile'			=> 'מצב OUTFILE',// 2.0.7 pro

// יבוא	
'combo_file'		=> 'קובץ',
'combo_strategy'	=> 'אסטרטגיה לשחזור',
'ext_legend'		=> 'אפשרויות נוספות',
'correct'			=> 'תיקון קידוד',
'autoinc'			=> 'לאפס AUTO_INCREMENT',
'prefix'			=> 'לשנות את הקידומת מ %s ל %s',// 2.0.7 pro
'savesql'			=> 'לשמור קובץ SQL',// 2.0.7 pro
'infile'			=> ' לקובץ',// 2.0.7 pro

// יומן 
'status_current'	=> 'מצב נוכחי',
'status_total'		=> 'מצב כללי',
'time_elapsed'		=> 'עבר',
'time_left'			=> 'נשאר',
'btn_stop'			=> 'לעצור',
'btn_pause'			=> 'הפסקה',
'btn_resume'		=> 'להמשיך',
'btn_again'			=> 'לחזור שוב',
'btn_clear'			=> 'ניקוי יומן',

// קבצים
'btn_delete'		=> 'למחוק',
'btn_download'		=> 'להוריד',
'btn_open'			=> 'לפתוח',

// שירותים
'opt_check'			=> 'אפשרויות של הבדיקה',
'opt_repair'		=> 'אפשרויות של התיקון',
'btn_delete_db'		=> 'למחוק בסיס נתונים',
'btn_check'			=> 'לבדוק',
'btn_repair'		=> 'לתקן',
'btn_analyze'		=> 'לנתח',
'btn_optimize'		=> 'לייעל',
'btn_extra'			=> 'בנוסף...',// 2.0.7 pro

// אפשרויות
'cfg_legend'		=> 'התצורה הבסיסית',
'cfg_time_web'		=> 'זמן ריצה ב WEB (שניות)',
'cfg_time_cron'		=> 'זמן ריצה ב CRON (שניות)',
'cfg_backup_path'	=> 'הנתיב לתיקיה backup',
'cfg_backup_url'	=> 'URL לתיקיית backup',
'cfg_globstat'		=> 'סטטיסטיקה ככלית',
'cfg_extended'		=> 'אפשרויות מתקדמות',
'cfg_charsets'		=> 'פילטר קידוד',
'cfg_only_create'	=> 'גיבוי רק של המבנה',
'cfg_auth'			=> 'שרשרת של הרשאה',
'cfg_confirm'		=> 'לבקש אישור',
'cfg_conf_import'	=> 'ייבוא בסיס נתונים',
'cfg_conf_file'		=> 'למחיקה של הקובץ',
'cfg_conf_db'		=> 'למחיקה של בסיס נתונים',
'cfg_conf_truncate'	=> 'לניקוי טבלה',// 2.0.7 pro
'cfg_conf_drop'		=> 'למחיקת טבלה',// 2.0.7 pro
'cfg_outfile_path'	=> 'נתיב ל OUTFILE',// 2.0.7 pro
'cfg_outfile_size'	=> 'גודל המאגר ל OUTFILE (МБ)',// 2.0.7 pro

// חיבור
'con_header'		=> 'הגדרות חיבור',
'connect'			=> 'חיבור',
'my_host'			=> 'המארח',
'my_port'			=> 'פורט',
'my_user'			=> 'משתמש',
'my_pass'			=> 'סיסמה',
'my_pass_hidden'	=> 'הסיסמה אינה מוצגת',
'my_comp'			=> 'פרוטוקול עם דחיסת',
'my_db'				=> 'בסיסי נתונים',
'btn_cancel'		=> 'ביטול',

// שמירת משימה
'sj_header'			=> 'שמירת משימה',
'sj_job'			=> 'משימה',
'sj_name'			=> 'שם באנגלית',
'sj_title'			=> 'תאור',

// יצירת מסד נתונים
'cdb_header'		=> 'יצירת מסד נתונים',
'cdb_detail'		=> 'פרטים',
'cdb_name'			=> 'כנוי',
'combo_collate'		=> 'השוואה',
'btn_create'		=> 'ליצור',
'hint'				=> 'רמז',// 2.0.7 pro

// ההרשאה
'js_required'		=> 'JavaScript צריך להיות כלול',
'auth'				=> 'ההרשאה',
'auth_user'			=> 'משתמש',
'auth_remember'		=> 'לזכור',
'btn_enter'			=> 'להכנס',
'btn_details'		=> 'פרטים',

// הודעות ביומן
'not_found_rtl'		=> 'חסר קובץ RTL',
'backup_begin'		=> 'הפעלת הייצוא של ב"נ `%s`',
'backup_TC'			=> 'ייצוא של הטבלה `%s`',
'backup_VI'			=> 'ייצוא לצפיה `%s`',
'backup_PR'			=> 'ייצוא ההליכים `%s`',
'backup_FU'			=> 'ייצוא פונקציות `%s`',
'backup_EV'			=> 'יצא אירוע `%s`',
'backup_TR'			=> 'ייצוא טריגר `%s`',
'continue_from'		=> 'מתוך עמדה %s',
'backup_end'		=> 'גיבוי ב"נ `%s` נוצר.',
'autodelete'		=> 'מחיקה אוטומטית של קבצים ישנים',
'del_by_date'		=> '- `%s` - מחוק (לפי תאריך)',
'del_by_count'		=> '- `%s` - מחוק (לפי ספירה)',
'del_fail'			=> '- `%s` - הסרה נכשלה',
'del_nothing'		=> '- אין קבצים למחיקה',
'set_names'			=> 'קידוד החיבור שנוצר `%s`',
'restore_begin'		=> 'התחלה  של ייבוא `%s`',
'restore_TC'		=> 'ייבוא הטבלה `%s`',
'restore_VI'		=> 'ייבוא ​​צפיות `%s`',
'restore_PR'		=> 'ייבוא ההליכים `%s`',
'restore_FU'		=> 'ייבוא ​​פונקציה `%s`',
'restore_EV'		=> 'ייבוא ​​אירועים `%s`',
'restore_TR'		=> 'ייבוא טריגר `%s`',
'restore_keys'		=> 'הכללה של האינדקס',
'restore_end'		=> 'ב"נ `%s` שוחזר מגיבוי .',
'stop_1'			=> 'ביצוע הופסק על ידי המשתמש', 
'stop_2'			=> 'ביצוע נעצר על ידי המשתמש',
'stop_3'			=> 'ביצוע הופסק לפי טיימר',
'stop_4'			=> 'ביצוע נעצר לפי טיימר',
'stop_5'			=> 'ביצוע הופסק עקב שגיאה',
'job_done'			=> 'המשימה הושלמה בהצלחה',
'file_size'			=> 'גודל הקובץ',
'job_time'			=> 'משך הזמן',
'seconds'			=> 'שניות',
'job_freeze'		=> 'התהליך לא עודכן במשך יותר מ 30 שניות. לחץ על המשך',
'stop_job'			=> 'בקשה לעצור',

// תוויות JS
'js' => array(

	// שמות של לשוניות
	'backup'		=> 'ייצוא מסד נתונים',
	'restore'		=> 'ייבוא ​​מסד נתונים',
	'log'			=> 'יומן פעילות',
	'result'		=> 'תוצאת',
	'files'			=> 'קבצי גיבוי',
	'services'		=> 'שרותים',
	'options'		=> 'אפשרויות',

	// הכותרות של הטבלאות
	'dt'			=> 'תאריך ושעה',
	'action'		=> 'פעולה',
	'db'			=> 'מסד נתונים',
	'type'			=> 'טיפוס',
	'tab'			=> 'טבלה',
	'records'		=> 'רישומים',
	'size'			=> 'גודל',
	'comment'		=> 'הערות',
	
	// סטטוסים
	'load'			=> 'טעינה',
	'run'			=> 'בצוע...',
	'sdb'			=> 'יצירת מסד נתונים',
	'sc'			=> 'שמירת חיבור',
	'sj'			=> 'שמירת משימה',
	'so'			=> 'שמירת איפשרויות',

	// ההודעות
	'pro'			=> 'אפשרות זו זמינה רק בגרסה-Pro',
	'err_fopen'		=> 'אין אפשרות לפתוח את הקובץ',
	'err_sxd2'		=> 'הצגת תוכן הקובץ זמין רק עבור קבצים שנוצרו Sypex Dumper 2',
	'err_empty_db'	=> 'מסד נתונים ריק',
	'fdc'			=> 'האם אתה בטוח שברצונך למחוק קובץ?',
	'ddc'			=> 'האם אתה בטוח שברצונך למחוק מסד נתונים?',
	'fic'			=> 'האם אתה בטוח שברצונך לייבא את הקובץ?',
	'ttc'			=> 'האם אתה בטוח שברצונך לנקות את הטבלה?',// 2.0.7 pro
	'tdc'			=> 'האם אתה בטוח שברצונך למחוק את את הטבלה?',// 2.0.7 pro

	// הקיצורים של הגדלים
	'sizes'			=> array('Б', 'КБ', 'МБ', 'ГБ'),

	// תיקון ושינוי של הקידוק
	'chc_header'	=> 'שינוי קידוד',// 2.0.7 pro
	'coc_header'	=> 'תיקון קידוד',// 2.0.7 pro

	'hint_chc'		=> 'שינוי הקידוד הדרוש במקרים שבהם אתה צריך לשנות את קידוד טבלאות והנתונים, למשל, מ cp1251 ל utf8.',// 2.0.7 pro
	'hint_coc'		=> 'תיקון שלהקידוד הוא הכרחי במקרים של אי תאימות של קידוד בהטבלה',// 2.0.7 pro
	'need_backup'	=> 'מומלץ לבצע גיבוי של מסד הנתונים.',// 2.0.7 pro
	
	// שירותים נוספים
	'btn_chc'		=> 'לשנות את הקידוד',// 2.0.7 pro
	'btn_coc'		=> 'תיקון קידוד',// 2.0.7 pro
	'btn_enable'	=> 'לכלול אינדקסים',// 2.0.7 pro
	'btn_disable'	=> 'בטל אינדקסים',// 2.0.7 pro
	'btn_truncate'	=> 'ניקוי טבלאות',// 2.0.7 pro
	'btn_drop'		=> 'הסר טבלאות',// 2.0.7 pro
	'btn_drop_db'	=> 'מחיקת מסד נתונים',// 2.0.7 pro
)
);
?>
